
// Подключение основного файла стилей
import "../scss/style.scss";
// Плагины ============================================================================================================================================================================================================================================================================================================

/* Динамический адаптив */
 import "./libs/dynamic_adapt.js";

 // Основные модули ========================================================================================================================================================================================================================================================
import * as flsFunctions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
flsFunctions.isWebp();
/* Добавление класса touch для HTML если браузер мобильный */
 flsFunctions.addTouchClass();
/* Добавление loaded для HTML после полной загрузки страницы */
 flsFunctions.addLoadedClass();
/* Модуль для работы с меню (Бургер) */
 flsFunctions.menuInit();
/* Учет плавающей панели на мобильных устройствах при 100vh */
 flsFunctions.fullVHfix();

/*
Модуль "показать еще"
Документация по работе в шаблоне:
Сниппет (HTML): showmore
*/
flsFunctions.showMore();

// Работа с формами ========================================================================================================================================================================================================================================================
import * as flsForms from "./files/forms/forms.js";

/* Работа с полями формы: добавление классов, работа с placeholder. */
 flsForms.formFieldsInit();

/* Модуль работы с select. */
flsForms.formSelect();

// Работа со слайдером (Swiper) ========================================================================================================================================================================================================================================================
/*
Настройка подключения плагина слайдера Swiper и новых слайдеров выполняется в файле js/files/sliders.js
Документация по работе в шаблоне:
Документация плагина: https://swiperjs.com/
Сниппет(HTML): swiper
*/
import "./files/sliders.js";

// Функции работы скроллом ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
import * as flsScroll from "./files/scroll/scroll.js";

// Плавная навигация по странице
flsScroll.pageNavigation();

// Прочее ========================================================================================================================================================================================================================================================
/* Подключаем файлы со своим кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================